app/Http/Controllers/BuildingFloorController.php

    public function index(Building $building)
    {
        $query = $building->floors()->with('status');

        // Filtre par statut
        if (request('status')) {
            $query->whereHas('status', fn ($q) => $q->where('code', request('status')));
        }

        // Recherche par numéro d'étage
        if (request('search')) {
            $search = request('search');
            $query->where('number', 'like', "%$search%");
        }

        $floors = $query->latest()->paginate(10)->withQueryString();
        $statuses = \App\Models\FloorStatus::all();
---
select * from `floors` where `floors`.`building_id` = 1 and `floors`.`building_id` is not null
select * from `floor_statuses`