app/Http/Controllers/ContractController.php

    public function index()
    {
        $contracts = Contract::with(['student', 'room', 'status'])->latest()->paginate(10);
---
select * from `contracts` order by `created_at` desc limit 10 offset 0
select * from `rooms` where `rooms`.`id` in (1, 7)
select * from `students` where `students`.`id` in (2)
select count(*) as aggregate from `contracts`

    public function create()
    {
        return view('contracts.create', [
            'students' => Student::all(),
            'rooms' => Room::all(),
            'billingPeriods' => BillingPeriod::all(),
        ]);
---
select * from `billing_periods`

    public function show(Contract $contract)
    {
        $contract->load(['student', 'room', 'payments']);
---
select * from `students`
select * from `rooms`

    public function edit(Contract $contract)
    {
        return view('contracts.edit', [
            'contracts' => $contract,
            'students' => Student::all(),
            'rooms' => Room::all(),
            'billingPeriods' => BillingPeriod::all(),
        ]);
---
select * from `billing_periods`