app/Http/Controllers/DashboardController.php

select count(*) as aggregate from `users` where exists (select * from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `users`.`id` = `role_user`.`user_id` and `name` = 'student')
select count(*) as aggregate from `contracts`
select count(*) as aggregate from `payments`
select count(*) as aggregate from `payment_history`
select * from `payment_history` order by `created_at` desc limit 5
select * from `contracts` where `contracts`.`id` in (1)
select * from `users` where `users`.`id` in (3)
select * from `contracts` order by `created_at` desc limit 5
select * from `rooms` where `rooms`.`id` in (2)
---
    private function getSuperAdminStats()
    {
        return [
            'role' => 'super_admin',
            'totalStudents' => User::whereHas('roles', fn ($q) => $q->where('name', 'student'))->count(),
            'totalContracts' => Contract::count(),
            'activeContracts' => Contract::whereHas('status', fn ($q) => $q->where('code', 'active'))->count(),
            'pendingContracts' => Contract::whereHas('status', fn ($q) => $q->where('code', 'pending'))->count(),
            'totalPayments' => Payment::count(),
            'validatedPayments' => Payment::whereHas('status', fn ($q) => $q->where('code', 'validated'))->count(),
            'pendingPayments' => Payment::whereHas('status', fn ($q) => $q->where('code', 'pending'))->count(),
            'processingPayments' => Payment::whereHas('status', fn ($q) => $q->where('code', 'processing'))->count(),
            'totalPaymentHistories' => PaymentHistory::count(),
            'recentHistories' => PaymentHistory::latest()->take(5)->get(),
            'recentPayments' => Payment::with(['contract.user', 'status'])->whereHas('status', fn ($q) => $q->where('code', 'validated'))->latest()->take(10)->get(),
            'recentContracts' => Contract::with(['user', 'room', 'status'])->latest()->take(5)->get(),
            // Audit statistics
            'totalAudits' => Audit::count(),
            'auditsByEvent' => [
                'created' => Audit::byEvent('created')->count(),
                'updated' => Audit::byEvent('updated')->count(),
                'deleted' => Audit::byEvent('deleted')->count(),
                'restored' => Audit::byEvent('restored')->count(),

select * from `contracts` where `contracts`.`user_id` = 3 and `contracts`.`user_id` is not null
---
    private function getAdminStats()
    {
        $user = Auth::user();
        $residences = $user->residences;

        // Stats globales
        $totalStudents = User::whereHas('roles', fn ($q) => $q->where('name', 'student'))->count();
        $activeStudents = User::whereHas('roles', fn ($q) => $q->where('name', 'student'))
            ->whereHas('contracts', fn ($q) => $q->whereHas('status', fn ($s) => $s->where('code', 'active')))
            ->count();

        // Contract stats
        $totalContracts = Contract::count();
        $contractsByStatus = [
            'pending' => Contract::whereHas('status', fn ($q) => $q->where('code', 'pending'))->count(),
            'active' => Contract::whereHas('status', fn ($q) => $q->where('code', 'active'))->count(),
            'overdue' => Contract::whereHas('status', fn ($q) => $q->where('code', 'overdue'))->count(),
            'expired' => Contract::whereHas('status', fn ($q) => $q->where('code', 'expired'))->count(),
            'archived' => Contract::whereHas('status', fn ($q) => $q->where('code', 'archived'))->count(),
        ];

        // Payment stats
        $totalPayments = Payment::count();
        $paymentsByStatus = [
            'pending' => Payment::whereHas('status', fn ($q) => $q->where('code', 'pending'))->count(),
            'processing' => Payment::whereHas('status', fn ($q) => $q->where('code', 'processing'))->count(),
            'validated' => Payment::whereHas('status', fn ($q) => $q->where('code', 'validated'))->count(),
            'cancelled' => Payment::whereHas('status', fn ($q) => $q->where('code', 'cancelled'))->count(),
        ];

select * from `payments` where exists (select * from `contracts` where `payments`.`contract_id` = `contracts`.`id` and `user_id` = 3)
---
            ];
        }

        return [
            'role' => 'admin',
            'totalStudents' => $totalStudents,
            'activeStudents' => $activeStudents,
            'totalContracts' => $totalContracts,
            'contractsByStatus' => $contractsByStatus,
            'activeContracts' => $contractsByStatus['active'],
            'pendingContracts' => $contractsByStatus['pending'],
            'totalPayments' => $totalPayments,
            'paymentsByStatus' => $paymentsByStatus,
            'validatedPayments' => $paymentsByStatus['validated'],
            'pendingPayments' => $paymentsByStatus['pending'],
            'processingPayments' => $paymentsByStatus['processing'],
            'residenceStats' => $residenceStats,
            'recentPayments' => Payment::with(['contract.user', 'status'])->whereHas('status', fn ($q) => $q->where('code', 'validated'))->latest()->take(10)->get(),
            'recentContracts' => Contract::with(['user', 'room', 'status'])->latest()->take(5)->get(),
        ];