app/Http/Controllers/DashboardController.php

    private function getSuperAdminStats()
    {
        return [
            'role' => 'super_admin',
            'totalStudents' => Student::count(),
            'totalContracts' => Contract::count(),
            'activeContracts' => Contract::whereHas('status', fn ($q) => $q->where('code', 'active'))->count(),
            'pendingContracts' => Contract::whereHas('status', fn ($q) => $q->where('code', 'pending'))->count(),
            'totalPayments' => Payment::count(),
            'validatedPayments' => Payment::whereHas('status', fn ($q) => $q->where('code', 'validated'))->count(),
            'pendingPayments' => Payment::whereHas('status', fn ($q) => $q->where('code', 'pending'))->count(),
            'processingPayments' => Payment::whereHas('status', fn ($q) => $q->where('code', 'processing'))->count(),
            'totalBillingPeriods' => BillingPeriod::count(),
            'activeBillingPeriods' => BillingPeriod::where('is_active', true)->count(),
            'totalPaymentHistories' => PaymentHistory::count(),
            'recentHistories' => PaymentHistory::latest()->take(5)->get(),
            'recentPayments' => Payment::with(['contract.student', 'status'])->latest()->take(10)->get(),
---
select * from `payments` order by `created_at` desc limit 10