app/Http/Controllers/FloorRoomController.php

select * from `room_statuses` where `room_statuses`.`id` in (1)
select * from `rooms` where `rooms`.`floor_id` = 2 and `rooms`.`floor_id` is not null
---
    public function index(Floor $floor)
    {
        $rooms = $floor->rooms()->with('status')->paginate(15);

select * from `room_statuses`
---
    public function create(Floor $floor)
    {
        $statuses = RoomStatus::all();

insert into `rooms` (`room_status_id`, `number`, `rent`, `capacity`, `floor_id`, `updated_at`, `created_at`) values ('3', '3', '20000', '1', 3, '2026-03-22 16:53:22', '2026-03-22 16:53:22')
---
    public function store(Request $request, Floor $floor)
    {
        // Check if floor capacity is not exceeded
        $existingCount = $floor->rooms()->count();
        if ($existingCount >= $floor->capacity) {
            return back()->withErrors(['capacity' => "You have reached the maximum number of rooms ({$floor->capacity}) for this floor."]);
        }

        $validated = $request->validate([
            // Adding room status
            'room_status_id' => ['required', 'exists:room_statuses,id'],
            'number' => ['required','integer', 'min:1',
                Rule::unique('rooms')->where(function ($query) use ($floor) {
                    return $query->where('floor_id', $floor->id);
                }),],
            'rent' => ['required', 'numeric', 'min:0'],
            'capacity' => ['required', 'integer', 'min:1'],
        ],
            [
                'number.unique' => 'This room already exists in this floor.',

            ]);
        $floor->rooms()->create($validated);