app/Http/Controllers/PaymentController.php

select * from `contracts` where `contracts`.`id` in (1)
select * from `payments` order by `created_at` desc limit 15 offset 0
select * from `users` where `users`.`id` in (3)
select count(*) as aggregate from `payments`
---
    public function index()
    {
        $payments = Payment::with(['contract.user', 'status'])->latest()->paginate(15);