app/Http/Controllers/PermissionController.php

select * from `permissions` order by `name` asc
select `roles`.*, `permission_role`.`permission_id` as `pivot_permission_id`, `permission_role`.`role_id` as `pivot_role_id`, `permission_role`.`created_at` as `pivot_created_at`, `permission_role`.`updated_at` as `pivot_updated_at` from `roles` inner join `permission_role` on `roles`.`id` = `permission_role`.`role_id` where `permission_role`.`permission_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30)
---
    public function index()
    {
        $permissions = Permission::with('roles')
            ->orderBy('name')
            ->paginate(10);