app/Http/Controllers/ProfileController.php

    public function show(Request $request): View
    {
        $user = $request->user()->load(['userStatus', 'roles']);
---
select * from `user_statuses` where `user_statuses`.`id` in (2)
select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id`, `role_user`.`created_at` as `pivot_created_at`, `role_user`.`updated_at` as `pivot_updated_at` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` in (1)