app/Http/Controllers/ResidenceController.php

select * from `residences` limit 6 offset 0
select count(*) as aggregate from `residences`
---
    public function index()
    {
        $residences = Residence::with('status')->paginate(6);

select * from `residence_statuses`
---
    public function create()
    {
        $statuses = ResidenceStatus::all();