app/Http/Controllers/UserController.php

     public function index()
    {
        $query = User::with('roles', 'userStatus');

        // Filtre par rôle
        if (request('role')) {
            $query->whereHas('roles', fn ($q) => $q->where('name', request('role')));
        }

        // Recherche par nom, prénom ou email
        if (request('search')) {
            $search = request('search');
            $query->where('firstname', 'like', "%$search%")
                  ->orWhere('lastname', 'like', "%$search%")
                  ->orWhere('email', 'like', "%$search%")
                  ->orWhere('phone', 'like', "%$search%");
        }

        $users = $query->latest()->paginate(15);
        $roles = Role::all();
---
select * from `user_statuses` where `user_statuses`.`id` in (2)
select * from `users` where exists (select * from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `users`.`id` = `role_user`.`user_id` and `name` = 'student') order by `created_at` desc limit 15 offset 0
select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id`, `role_user`.`created_at` as `pivot_created_at`, `role_user`.`updated_at` as `pivot_updated_at` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11)
select count(*) as aggregate from `users` where exists (select * from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `users`.`id` = `role_user`.`user_id` and `name` = 'student')
select * from `roles`