app/Models/ContractStatus.php

    public static function getIdByCodeOrFail(string $code): int
    {
        $id = static::where('code', $code)->value('id');
---
select `id` from `contract_statuses` where `code` = 'pending' limit 1