app/Models/Contract.php

select `id` from `contract_statuses` where `code` = 'active' limit 1
---
    public static function hasOverlap($roomId, $start, $end, $ignoreId = null)
    {
        $pendingId = ContractStatus::where('code', 'pending')->value('id');