app/Models/UserStatus.php

select `id` from `user_statuses` where `code` = 'active' limit 1
---
    public static function getIdByCode(string $code): int
    {
        return static::where('code',$code)->value('id');