app/Models/User.php

    public function hasRole(string $roleName): bool
    {
        return $this->roles()->where('name', $roleName)->exists();
---
select exists(select * from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` = 1 and `name` = 'super_admin') as `exists`