app/Http/Controllers/Admin/PendingUserController.php

    public function edit(User $user): View
    {
        $user->load(['userStatus', 'roles']);

        $roles = Role::where('name', '!=', Role::SUPER_ADMIN)
            ->orderBy('label')
            ->get();
---
select * from `user_statuses` where `user_statuses`.`id` in (1)
select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id`, `role_user`.`created_at` as `pivot_created_at`, `role_user`.`updated_at` as `pivot_updated_at` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` in (3)
select * from `roles` where `name` != 'super_admin' order by `label` asc